# **SQL Exercise : CTE and Window Function**
# Database: world

___

## Import library

In [9]:
pip install mysql.connector

Requirement already satisfied: mysql.connector in /Users/nurul/opt/anaconda3/lib/python3.8/site-packages (2.2.9)
Note: you may need to restart the kernel to use updated packages.

In [10]:
import pandas as pd
import numpy as np
import mysql.connector
import sqlalchemy as alc
from sqlalchemy import create_engine

### Specify database

In [11]:
# mysql connector
mydb = mysql.connector.connect(
    host ='localhost',
    user = 'root',
    passwd = 'nrlsyff97',
    database = 'world'
)

In [12]:
engine = create_engine('mysql+mysqlconnector://root:nrlsyff97@localhost/world')

In [13]:
query='''
show full tables;
'''
pd.read_sql_query(query, engine)

   Tables_in_world                                Table_type
0             city  [66, 65, 83, 69, 32, 84, 65, 66, 76, 69]
1          country  [66, 65, 83, 69, 32, 84, 65, 66, 76, 69]
2  countrylanguage  [66, 65, 83, 69, 32, 84, 65, 66, 76, 69]
3           Person  [66, 65, 83, 69, 32, 84, 65, 66, 76, 69]

In [14]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from country
limit 10;
''')

myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.00,NaN,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919.0,22720000,45.9,5976.00,None,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF
2,AGO,Angola,Africa,Central Africa,1246700.00,1975.0,12878000,38.3,6648.00,7984.00,Angola,Republic,José Eduardo dos Santos,56,AO
3,AIA,Anguilla,North America,Caribbean,96.00,NaN,8000,76.1,63.20,None,Anguilla,Dependent Territory of the UK,Elisabeth II,62,AI
4,ALB,Albania,Europe,Southern Europe,28748.00,1912.0,3401200,71.6,3205.00,2500.00,Shqipëria,Republic,Rexhep Mejdani,34,AL
5,AND,Andorra,Europe,Southern Europe,468.00,1278.0,78000,83.5,1630.00,None,Andorra,Parliamentary Coprincipality,,55,AD
6,ANT,Netherlands Antilles,North America,Caribbean,800.00,NaN,217000,74.7,1941.00,None,Nederlandse Antillen,Nonmetropolitan Territory of The Netherlands,Beatrix,33,AN
7,ARE,United Arab Emirates,Asia,Middle East,83600.00,1971.0,2441000,74.1,37966.00,36846.00,Al-Imarat al-´Arabiya al-Muttahida,Emirate Federation,Zayid bin Sultan al-Nahayan,65,AE
8,ARG,Argentina,South America,South America,2780400.00,1816.0,37032000,75.1,340238.00,323310.00,Argentina,Federal Republic,Fernando de la Rúa,69,AR
9,ARM,Armenia,Asia,Middle East,29800.00,1991.0,3520000,66.4,1813.00,1627.00,Hajastan,Republic,Robert Kotšarjan,126,AM

## 1. Ten country names (Name) and the number of languages (language), both official and unofficial in every country, from the Country and CountryLanguage tables. This query shows only countries where the number of languages is above the average number of languages per country, sorted by the country that counts most languages.

In [15]:
query = '''
WITH 
    Total_Bahasa AS (
        SELECT 
            C.Name AS Country_Name,
            COUNT(CL.Language) AS Total_Language
        FROM 
            Country C
        JOIN 
            Countrylanguage CL ON C.Code = CL.CountryCode
        GROUP BY Country_Name)

SELECT * 
FROM Total_Bahasa
WHERE Total_Language > (SELECT AVG(Total_Language) FROM Total_Bahasa)
ORDER BY Total_Language DESC
LIMIT 10;
;'''

pd.read_sql_query(query,engine)

         Country_Name  Total_Language
0              Canada              12
1               India              12
2               China              12
3  Russian Federation              12
4       United States              12
5            Tanzania              11
6        South Africa              11
7         Philippines              10
8                Iran              10
9             Nigeria              10

## 2. Show ten country names (Name), form of government (GovernmentForm), total population of all countries (Population), percentage of the population for each country, and row index number for each country from the Country table.

In [16]:
query='''
SELECT 
    Name,
    GovernmentForm,
    SUM(Population) OVER() AS World_Population,
    Population,
    Population / SUM(Population) OVER() * 100 AS Pop_Percentage,
    ROW_NUMBER() OVER() AS Row_Index
FROM 
    Country
ORDER BY 
    Pop_Percentage DESC
;
'''
pd.read_sql_query(query,engine)

,Name,GovernmentForm,World_Population,Population,Pop_Percentage,Row_Index
0,China,People'sRepublic,6.078749e+09,1277558000,21.0168,42
1,India,Federal Republic,6.078749e+09,1013662000,16.6755,100
2,United States,Federal Republic,6.078749e+09,278357000,4.5792,224
3,Indonesia,Republic,6.078749e+09,212107000,3.4893,99
4,Brazil,Federal Republic,6.078749e+09,170115000,2.7985,31
...,...,...,...,...,...,...
234,Pitcairn,Dependent Territory of the UK,6.078749e+09,50,0.0000,167
235,South Georgia and the South Sandwich Islands,Dependent Territory of the UK,6.078749e+09,0,0.0000,188
236,Norfolk Island,Territory of Australia,6.078749e+09,2000,0.0000,155
237,Christmas Island,Territory of Australia,6.078749e+09,2500,0.0000,53
238,British Indian Ocean Territory,Dependent Territory of the UK,6.078749e+09,0,0.0000,101

## 3. Case Study: Potential Consumer Segment Analysis
The potential consumer segment usually lives in the national capital area. Although,
it does not rule out the possibility of cities outside the capital experiencing rapid development,
both in market quantity and consumer purchasing power. The GNP of a country is not small,
contributed by companies operating in the capital area. Sometimes the factory is 
outside the capital, but its headquarters will be located. Thus, the capital citizens are a potential market because many work in companies
as significant contributors to national GNP. So, GNP more or less also reflects the purchasing power of citizens
in the capital of a country. To develop a global strategy, a multinational company
requires continent ranking data based on the capital's population and ranking
continents based on the average GNP of all countries on the continent. The output table show continents, then analyzed total capital population, average GNP, population rank, and GNP rank for every continents. According to analysis, Asia and Europe should be prioritized for marketing company products

In [19]:
query='''
SELECT 
    C.Continent,
    SUM(CT.Population) AS Total_Capital_Population,
    AVG(C.GNP) AS Average_GNP,
    RANK() OVER (ORDER BY SUM(CT.Population) DESC) AS Rank_Population,
    RANK() OVER (ORDER BY AVG(C.GNP) DESC) AS Rank_GNP
FROM 
    City CT 
JOIN 
    Country C
    ON C.Capital = CT.Id
GROUP BY 1
ORDER BY 4,5
;
'''
pd.read_sql_query(query,engine)

,Continent,Total_Capital_Population,Average_GNP,Rank_Population,Rank_GNP
0,Asia,101322793.0,150105.725490,1,3
1,Europe,51917214.0,206497.065217,2,2
2,Africa,47714282.0,10182.017544,3,6
3,South America,28900527.0,107991.000000,4,4
4,North America,19120216.0,261854.789189,5,1
5,Oceania,1142110.0,15547.211111,6,5

Another multinational company has a different strategic approach. This company is not using the continent approach as the priority of the target market but directly targets the priority country. This company also does not emphasize market size (market size) but instead market purchasing power (consumer's buying power). One aspect that reflects the purchasing power in a country is GNP. The assumption is that the higher a country's GNP, the higher the priority becomes the product marketing target. By only targeting countries that donate Eighty per cent of the total global GNP, marketing operations will be more efficient. This study shows a SQL query to display:
* Priority country name,
* Percentage of each country's GNP compared to the total Global GNP,
* The cumulative value (Moving Sum) of the GNP percentage is only up to 80 per cent,
* Ranking by the percentage of GNP, and
* Group these priority countries into 4 Market Priority groups.

In [20]:
query='''
WITH 
    GNP_Table AS (
        SELECT 
            Name AS Country_Name,            
            GNP,
            SUM(GNP) OVER() as Total_GNP,
            ROUND(GNP / SUM(GNP) OVER () * 100, 2) AS GNP_Percentage
        FROM 
            Country
        ORDER BY 
            GNP_Percentage DESC
        )

SELECT 
    Country_Name,
    GNP_Percentage,
    ROUND(SUM(GNP_Percentage) OVER (ORDER BY GNP_Percentage DESC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW), 2) AS Cumulative_GNP,
    RANK() OVER (ORDER BY GNP_Percentage DESC) AS GNP_Rank,
    NTILE(4) OVER () AS Market_Priority_1234 
FROM 
    GNP_Table
WHERE 
    GNP_Percentage > 1
;
'''
pd.read_sql_query(query,engine)

,Country_Name,GNP_Percentage,Cumulative_GNP,GNP_Rank,Market_Priority_1234
0,United States,28.99,28.99,1,1
1,Japan,12.90,41.89,2,1
2,Germany,7.27,49.16,3,1
3,France,4.85,54.01,4,1
4,United Kingdom,4.70,58.71,5,2
5,Italy,3.96,62.67,6,2
6,China,3.35,66.02,7,2
7,Brazil,2.65,68.67,8,2
8,Canada,2.04,70.71,9,3
9,Spain,1.88,72.59,10,3
10,India,1.52,74.11,11,3
11,Mexico,1.41,75.52,12,3
12,Netherlands,1.27,76.79,13,4
13,Australia,1.20,77.99,14,4
14,Argentina,1.16,79.15,15,4
15,South Korea,1.09,80.24,16,4